DenseNet_BC_100_12(
  (stack): Sequential(
    (0): Conv2d(3, 24, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): DenseBlock(
      (stack): Sequential(
        (0): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(24, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(24, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (1): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(36, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(36, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (2): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(48, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (3): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(60, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(60, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (4): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(72, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(72, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (5): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(84, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(84, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (6): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(96, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(96, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (7): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(108, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(108, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (8): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(120, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(120, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (9): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(132, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(132, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (10): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(144, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(144, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (11): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(156, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(156, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (12): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(168, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(168, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (13): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(180, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(180, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (14): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(192, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(192, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (15): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(204, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(204, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
      )
    )
    (2): TransitionBlock(
      (stack): Sequential(
        (0): BatchNorm2d(216, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (1): ReLU()
        (2): Conv2d(216, 108, kernel_size=(1, 1), stride=(1, 1))
        (3): AvgPool2d(kernel_size=2, stride=2, padding=0)
      )
    )
    (3): DenseBlock(
      (stack): Sequential(
        (0): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(108, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(108, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (1): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(120, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(120, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (2): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(132, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(132, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (3): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(144, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(144, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (4): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(156, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(156, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (5): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(168, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(168, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (6): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(180, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(180, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (7): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(192, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(192, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (8): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(204, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(204, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (9): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(216, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(216, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (10): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(228, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(228, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (11): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(240, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(240, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (12): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(252, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(252, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (13): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(264, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(264, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (14): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(276, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(276, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (15): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(288, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(288, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
      )
    )
    (4): TransitionBlock(
      (stack): Sequential(
        (0): BatchNorm2d(300, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (1): ReLU()
        (2): Conv2d(300, 150, kernel_size=(1, 1), stride=(1, 1))
        (3): AvgPool2d(kernel_size=2, stride=2, padding=0)
      )
    )
    (5): DenseBlock(
      (stack): Sequential(
        (0): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(150, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(150, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (1): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(162, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(162, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (2): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(174, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(174, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (3): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(186, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(186, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (4): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(198, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(198, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (5): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(210, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(210, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (6): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(222, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(222, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (7): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(234, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(234, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (8): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(246, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(246, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (9): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(258, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(258, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (10): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(270, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(270, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (11): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(282, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(282, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (12): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(294, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(294, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (13): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(306, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(306, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (14): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(318, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(318, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
        (15): DenseLayer(
          (stack): Sequential(
            (0): BatchNorm2d(330, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (1): ReLU()
            (2): Conv2d(330, 48, kernel_size=(1, 1), stride=(1, 1))
            (3): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (4): ReLU()
            (5): Conv2d(48, 12, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          )
        )
      )
    )
    (6): BatchNorm2d(342, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (7): ReLU()
    (8): AvgPool2d(kernel_size=8, stride=8, padding=0)
    (9): Flatten(start_dim=1, end_dim=-1)
    (10): Linear(in_features=342, out_features=10, bias=True)
    (11): Softmax(dim=1)
  )
)